implementation of some hunting ideas from this blog: https://medium.com/threatpunter/okta-threat-hunting-tips-62dc0013d526

//surface interesting events
CloudAppEvents
| where Timestamp > ago(1d)
| where Application == "Okta"
| extend eventType = parse_json(rawDataJson).eventType
| where eventType in ("app.oauth2.client_id_rate_limit_warning",
                      "application.integration.rate_limit_exceeded",
                      "system.client.concurrency_rate_limit.notification",
                      "system.api_token.create",
                      "security.threat.detected")
                  or eventType startswith "system.operation.rate_limit."
                  or eventType startswith "system.org.rate_limit."
